---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_GreaterThanOrEqual(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/aff18a46-fae0-6048-1eb5-d100240c8dd6.htm
---
# Autodesk.Revit.DB.ElementId.op_GreaterThanOrEqual Method

Determines whether one element id is not less than another element id.

## Syntax (C#)
```csharp
public static bool operator >=(
	ElementId elementId1,
	ElementId elementId2
)
```

## Parameters
- **elementId1** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **elementId2** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the first element id is not less than the second element id, otherwise, false.